In [1]:
import pandas as pd

In [2]:
d = {'one' : pd.Series([1,2,3], index = ['RDR2', 'CS:GO', 'Destiny2']),
     'two' : pd.Series([4,5,6,7], index = ['RDR2','CS:GO','Final Fantasy','GTA5'])   

}

In [3]:
df = pd.DataFrame(d)
df

               one  two
CS:GO          2.0  5.0
Destiny2       3.0  NaN
Final Fantasy  NaN  6.0
GTA5           NaN  7.0
RDR2           1.0  4.0

In [4]:
de = {'one' : pd.Series([100., 200., 300.], index=['apple', 'ball', 'clock']),
     'two' : pd.Series([111., 222., 333., 4444.], index=['apple', 'ball', 'cerill', 'dancy'])}

In [5]:
da = pd.DataFrame(de)
print(da)

one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [6]:
f = {'Car Rank' : pd.Series([100, 200 ,300, 400], index=['Mercedes', 'Porshe', 'Rolls-Royce', 'Aston Martin']),
     'Speed in mph' : pd.Series([212, 234, 250, 222,300], index=['Mercedes', 'Porshe', 'Lamborghini', 'Bently', 'McLaren'])
}

In [7]:
top_cars = pd.DataFrame(f)
top_cars

              Car Rank  Speed in mph
Aston Martin     400.0           NaN
Bently             NaN         222.0
Lamborghini        NaN         250.0
McLaren            NaN         300.0
Mercedes         100.0         212.0
Porshe           200.0         234.0
Rolls-Royce      300.0           NaN

In [8]:
top_cars.sort_values(by='Speed in mph')

              Car Rank  Speed in mph
Mercedes         100.0         212.0
Bently             NaN         222.0
Porshe           200.0         234.0
Lamborghini        NaN         250.0
McLaren            NaN         300.0
Aston Martin     400.0           NaN
Rolls-Royce      300.0           NaN

In [9]:
top_cars.index

Index(['Aston Martin', 'Bently', 'Lamborghini', 'McLaren', 'Mercedes',
       'Porshe', 'Rolls-Royce'],
      dtype='object')

In [10]:
top_cars.columns # This refers to the column headings

Index(['Car Rank', 'Speed in mph'], dtype='object')

In [11]:
pd.DataFrame(top_cars,index=['Bently','McLaren'],columns=['Car Rank'])

         Car Rank
Bently        NaN
McLaren       NaN

# Create DataFrame from list of Python dictionaries

In [12]:
data = [{'alex': 1, 'joe': 2}, {'ema': 5, 'dora': 10, 'alice': 20}]

In [13]:
pd.DataFrame(data)

   alex  joe  ema  dora  alice
0   1.0  2.0  NaN   NaN    NaN
1   NaN  NaN  5.0  10.0   20.0

In [14]:
stark = [{'Jon Snow' : 1, 'Bran stark' : 2, 'Sansa Strak' : 3, 'Arya Strak' : 4}, {'Tywin Lannister' : 6, 'Tyrion Lannister': 7, 'Cersei Lannister' : 8}]
show = pd.DataFrame(stark)
show

,Jon Snow,Bran stark,Sansa Strak,Arya Strak,Tywin Lannister,Tyrion Lannister,Cersei Lannister
0,1.0,2.0,3.0,4.0,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,6.0,7.0,8.0

# Basic DataFrame operations

In [15]:
show

,Jon Snow,Bran stark,Sansa Strak,Arya Strak,Tywin Lannister,Tyrion Lannister,Cersei Lannister
0,1.0,2.0,3.0,4.0,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,6.0,7.0,8.0

In [16]:
show['Sansa Strak']

0    3.0
1    NaN
Name: Sansa Strak, dtype: float64

In [17]:
top_cars['another'] = top_cars['Car Rank'] * top_cars['Speed in mph']

In [18]:
top_cars

              Car Rank  Speed in mph  another
Aston Martin     400.0           NaN      NaN
Bently             NaN         222.0      NaN
Lamborghini        NaN         250.0      NaN
McLaren            NaN         300.0      NaN
Mercedes         100.0         212.0  21200.0
Porshe           200.0         234.0  46800.0
Rolls-Royce      300.0           NaN      NaN

In [19]:
top_cars['flag'] = top_cars['another'] > 2000

In [20]:
top_cars

              Car Rank  Speed in mph  another   flag
Aston Martin     400.0           NaN      NaN  False
Bently             NaN         222.0      NaN  False
Lamborghini        NaN         250.0      NaN  False
McLaren            NaN         300.0      NaN  False
Mercedes         100.0         212.0  21200.0   True
Porshe           200.0         234.0  46800.0   True
Rolls-Royce      300.0           NaN      NaN  False

In [21]:
sample_cars = top_cars
#dele = sample_cars.pop('another')
sample_cars

              Car Rank  Speed in mph  another   flag
Aston Martin     400.0           NaN      NaN  False
Bently             NaN         222.0      NaN  False
Lamborghini        NaN         250.0      NaN  False
McLaren            NaN         300.0      NaN  False
Mercedes         100.0         212.0  21200.0   True
Porshe           200.0         234.0  46800.0   True
Rolls-Royce      300.0           NaN      NaN  False

In [22]:
another_del = top_cars
del another_del['flag']

In [23]:
another_del

              Car Rank  Speed in mph  another
Aston Martin     400.0           NaN      NaN
Bently             NaN         222.0      NaN
Lamborghini        NaN         250.0      NaN
McLaren            NaN         300.0      NaN
Mercedes         100.0         212.0  21200.0
Porshe           200.0         234.0  46800.0
Rolls-Royce      300.0           NaN      NaN

In [26]:
top_cars

              Car Rank  Speed in mph  another
Aston Martin     400.0           NaN      NaN
Bently             NaN         222.0      NaN
Lamborghini        NaN         250.0      NaN
McLaren            NaN         300.0      NaN
Mercedes         100.0         212.0  21200.0
Porshe           200.0         234.0  46800.0
Rolls-Royce      300.0           NaN      NaN

In [28]:
top_cars.insert(3, 'copy_of_Car_Rank', top_cars['Car Rank'])

In [29]:
top_cars

              Car Rank  Speed in mph  another  copy_of_Car_Rank
Aston Martin     400.0           NaN      NaN             400.0
Bently             NaN         222.0      NaN               NaN
Lamborghini        NaN         250.0      NaN               NaN
McLaren            NaN         300.0      NaN               NaN
Mercedes         100.0         212.0  21200.0             100.0
Porshe           200.0         234.0  46800.0             200.0
Rolls-Royce      300.0           NaN      NaN             300.0